nevinxu/HM502B2/platform/CMSIS/Include/device/MKL17Z4/MKL17Z4_sim.h
/*******************************************************************************
 * HW_SIM_SOPT5 - System Options Register 5
 ******************************************************************************/

/*!
 * @brief HW_SIM_SOPT5 - System Options Register 5 (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_sim_sopt5
{
    uint32_t U;
    struct _hw_sim_sopt5_bitfields
    {
        uint32_t LPUART0TXSRC : 2;     /*!< [1:0] LPUART0 Transmit Data Source
                                        * Select */
        uint32_t LPUART0RXSRC : 1;     /*!< [2] LPUART0 Receive Data Source
                                        * Select */
        uint32_t RESERVED0 : 1;        /*!< [3]  */
        uint32_t LPUART1TXSRC : 2;     /*!< [5:4] LPUART1 Transmit Data Source
                                        * Select */
        uint32_t LPUART1RXSRC : 1;     /*!< [6] LPUART1 Receive Data Source
                                        * Select */
        uint32_t RESERVED1 : 9;        /*!< [15:7]  */
        uint32_t LPUART0ODE : 1;       /*!< [16] LPUART0 Open Drain Enable */
        uint32_t LPUART1ODE : 1;       /*!< [17] LPUART1 Open Drain Enable */
        uint32_t UART2ODE : 1;         /*!< [18] UART2 Open Drain Enable */
        uint32_t RESERVED2 : 13;       /*!< [31:19]  */
    } B;
} hw_sim_sopt5_t;

/*!
 * @name Constants and macros for entire SIM_SOPT5 register
 */
/*@{*/
#define HW_SIM_SOPT5_ADDR(x)     ((x) + 0x1010U)

#define HW_SIM_SOPT5(x)          (*(__IO hw_sim_sopt5_t *) HW_SIM_SOPT5_ADDR(x))
#define HW_SIM_SOPT5_RD(x)       (HW_SIM_SOPT5(x).U)
#define HW_SIM_SOPT5_WR(x, v)    (HW_SIM_SOPT5(x).U = (v))
#define HW_SIM_SOPT5_SET(x, v)   (BME_OR32(HW_SIM_SOPT5_ADDR(x), (uint32_t)(v)))
#define HW_SIM_SOPT5_CLR(x, v)   (BME_AND32(HW_SIM_SOPT5_ADDR(x), (uint32_t)(~(v))))
#define HW_SIM_SOPT5_TOG(x, v)   (BME_XOR32(HW_SIM_SOPT5_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual SIM_SOPT5 bitfields
 */

/*!
 * @name Register SIM_SOPT5, field LPUART0TXSRC[1:0] (RW)
 *
 * Selects the source for the LPUART0 transmit data.
 *
 * Values:
 * - 00 - LPUART0_TX pin
 * - 01 - LPUART0_TX pin modulated with TPM1 channel 0 output
 * - 10 - LPUART0_TX pin modulated with TPM2 channel 0 output
 * - 11 - Reserved
 */
/*@{*/
#define BP_SIM_SOPT5_LPUART0TXSRC (0U)     /*!< Bit position for SIM_SOPT5_LPUART0TXSRC. */
#define BM_SIM_SOPT5_LPUART0TXSRC (0x00000003U) /*!< Bit mask for SIM_SOPT5_LPUART0TXSRC. */
#define BS_SIM_SOPT5_LPUART0TXSRC (2U)     /*!< Bit field size in bits for SIM_SOPT5_LPUART0TXSRC. */

/*! @brief Read current value of the SIM_SOPT5_LPUART0TXSRC field. */
#define BR_SIM_SOPT5_LPUART0TXSRC(x) (BME_UBFX32(HW_SIM_SOPT5_ADDR(x), BP_SIM_SOPT5_LPUART0TXSRC, BS_SIM_SOPT5_LPUART0TXSRC))

/*! @brief Format value for bitfield SIM_SOPT5_LPUART0TXSRC. */
#define BF_SIM_SOPT5_LPUART0TXSRC(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT5_LPUART0TXSRC) & BM_SIM_SOPT5_LPUART0TXSRC)

/*! @brief Set the LPUART0TXSRC field to a new value. */
#define BW_SIM_SOPT5_LPUART0TXSRC(x, v) (BME_BFI32(HW_SIM_SOPT5_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT5_LPUART0TXSRC), BP_SIM_SOPT5_LPUART0TXSRC, 2))
/*@}*/

/*!
 * @name Register SIM_SOPT5, field LPUART0RXSRC[2] (RW)
 *
 * Selects the source for the LPUART0 receive data.
 *
 * Values:
 * - 0 - LPUART_RX pin
 * - 1 - CMP0 output
 */
/*@{*/
#define BP_SIM_SOPT5_LPUART0RXSRC (2U)     /*!< Bit position for SIM_SOPT5_LPUART0RXSRC. */
#define BM_SIM_SOPT5_LPUART0RXSRC (0x00000004U) /*!< Bit mask for SIM_SOPT5_LPUART0RXSRC. */
#define BS_SIM_SOPT5_LPUART0RXSRC (1U)     /*!< Bit field size in bits for SIM_SOPT5_LPUART0RXSRC. */

/*! @brief Read current value of the SIM_SOPT5_LPUART0RXSRC field. */
#define BR_SIM_SOPT5_LPUART0RXSRC(x) (BME_UBFX32(HW_SIM_SOPT5_ADDR(x), BP_SIM_SOPT5_LPUART0RXSRC, BS_SIM_SOPT5_LPUART0RXSRC))

/*! @brief Format value for bitfield SIM_SOPT5_LPUART0RXSRC. */
#define BF_SIM_SOPT5_LPUART0RXSRC(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT5_LPUART0RXSRC) & BM_SIM_SOPT5_LPUART0RXSRC)

/*! @brief Set the LPUART0RXSRC field to a new value. */
#define BW_SIM_SOPT5_LPUART0RXSRC(x, v) (BME_BFI32(HW_SIM_SOPT5_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT5_LPUART0RXSRC), BP_SIM_SOPT5_LPUART0RXSRC, 1))
/*@}*/

/*!
 * @name Register SIM_SOPT5, field LPUART1TXSRC[5:4] (RW)
 *
 * Selects the source for the LPUART1 transmit data.
 *
 * Values:
 * - 00 - LPUART1_TX pin
 * - 01 - LPUART1_TX pin modulated with TPM1 channel 0 output
 * - 10 - LPUART1_TX pin modulated with TPM2 channel 0 output
 * - 11 - Reserved
 */
/*@{*/
#define BP_SIM_SOPT5_LPUART1TXSRC (4U)     /*!< Bit position for SIM_SOPT5_LPUART1TXSRC. */
#define BM_SIM_SOPT5_LPUART1TXSRC (0x00000030U) /*!< Bit mask for SIM_SOPT5_LPUART1TXSRC. */
#define BS_SIM_SOPT5_LPUART1TXSRC (2U)     /*!< Bit field size in bits for SIM_SOPT5_LPUART1TXSRC. */

/*! @brief Read current value of the SIM_SOPT5_LPUART1TXSRC field. */
#define BR_SIM_SOPT5_LPUART1TXSRC(x) (BME_UBFX32(HW_SIM_SOPT5_ADDR(x), BP_SIM_SOPT5_LPUART1TXSRC, BS_SIM_SOPT5_LPUART1TXSRC))

/*! @brief Format value for bitfield SIM_SOPT5_LPUART1TXSRC. */
#define BF_SIM_SOPT5_LPUART1TXSRC(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SOPT5_LPUART1TXSRC) & BM_SIM_SOPT5_LPUART1TXSRC)

/*! @brief Set the LPUART1TXSRC field to a new value. */
#define BW_SIM_SOPT5_LPUART1TXSRC(x, v) (BME_BFI32(HW_SIM_SOPT5_ADDR(x), ((uint32_t)(v) << BP_SIM_SOPT5_LPUART1TXSRC), BP_SIM_SOPT5_LPUART1TXSRC, 2))
/*@}*/

/*!
 * @name Register SIM_SOPT5, field LPUART1RXSRC[6] (RW)
 *
 * Selects the source for the LPUART1 receive data.
 *
 * Values:
 * - 0 - LPUART1_RX pin
 * - 1 - CMP0 output
 */
/*@{*/
#define BP_SIM_SOPT5_LPUART1RXSRC (6U)     /*!< Bit position for SIM_SOPT5_LPUART1RXSRC. */
#define BM_SIM_SOPT5_LPUART1RXSRC (0x00000040U) /*!< Bit mask for SIM_SOPT5_LPUART1RXSRC. */
#define BS_SIM_SOPT5_LPUART1RXSRC (1U)     /*!< Bit field size in bits for SIM_SOPT5_LPUART1RXSRC. */

